distro/protocol/samples/identify.xml

<s:Envelope 
    xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:wsmid="http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd">
    <s:Header/>
    <s:Body>
        <wsmid:Identify/>
    </s:Body>
</s:Envelope>


<s:Envelope 
    xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:wsmid="http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd"> 
<s:Header> 
 ... 
</s:Header> 
<s:Body> 
 <wsmid:IdentifyResponse> 
  <wsmid:ProtocolVersion> xs:anyURI </wsmid:ProtocolVersion> + 
   <wsmid:ProductVendor> xs:string </wsmid:ProductVendor> ? 
   <wsmid:ProductVersion> xs:string </wsmid:ProductVersion> ? 
     <wsmid:InitiativeSupport>  
       <wsmid:InitiativeName> xs:string </wsmid:InitiativeName> ? 
       <wsmid:InitiativeVersion> xs:string </wsmid:InitiativeVersion> ? 
     </wsmid:InitiativeSupport> ? 
     <wsmid:SecurityProfiles> 
       <wsmid:SecurityProfileName> xs:anyURI 
       </wsmid:SecurityProfileName> * 
     </wsmid:SecurityProfiles> ? 
     <wsmid:AddressingVersionURI> xs:anyURI 
     </wsmid:AddressingVersionURI> * 
     ... 
 </wsmid:IdentifyResponse> 
</s:Body> 
</s:Envelope> 


<wsmid:IdentifyResponse xmlns:wsmid="http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd" xml:lang="">
<wsmid:ProtocolVersion>
http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd</wsmid:ProtocolVersion>
<wsmid:ProductVendor>
Microsoft Corporation</wsmid:ProductVendor>
<wsmid:ProductVersion>
OS: 6.0.6002 SP: 2.0 Stack: 2.0</wsmid:ProductVersion>
</wsmid:IdentifyResponse>
